## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
route53.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 4 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                   |
|--------|----------------------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate`                     |
|        | `aws_route53_record.form_viewer_maintenance_mode_certificate_validation[&quot;forms-staging.cdssandbox.xyz&quot;]` |
|        | `aws_s3_bucket_website_configuration.maintenance_mode`                                                   |
| delete | `aws_route53_health_check.gc_forms_application`                                                          |
|        | `aws_s3_bucket_ownership_controls.maintenance_mode`                                                      |
| update | `aws_route53_record.form_viewer[0]`                                                                      |
|        | `aws_s3_bucket_acl.maintenance_mode`                                                                     |
|        | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3`                                   |
|        | `aws_s3_bucket_public_access_block.maintenance_mode`                                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate will be created
  + resource "aws_acm_certificate_validation" "form_viewer_maintenance_mode_cloudfront_certificate" {
      + certificate_arn         = "arn:aws:acm:us-east-1:687401027353:certificate/477e3f0d-675e-4c4b-822e-866d482d4928"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_health_check.gc_forms_application will be destroyed
  # (because aws_route53_health_check.gc_forms_application is not in configuration)
  - resource "aws_route53_health_check" "gc_forms_application" {
      - arn                    = "arn:aws:route53:::healthcheck/d9aa8ee2-a428-4cfb-824a-790c34aaab48" -> null
      - child_health_threshold = 0 -> null
      - child_healthchecks     = [] -> null
      - disabled               = true -> null
      - enable_sni             = false -> null
      - failure_threshold      = 2 -> null
      - fqdn                   = "form-viewer-1810755345.ca-central-1.elb.amazonaws.com" -> null
      - id                     = "d9aa8ee2-a428-4cfb-824a-790c34aaab48" -> null
      - invert_healthcheck     = false -> null
      - measure_latency        = false -> null
      - port                   = 80 -> null
      - regions                = [] -> null
      - request_interval       = 30 -> null
      - resource_path          = "/form-builder/edit" -> null
      - tags                   = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - type                   = "HTTP" -> null
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
      - health_check_id = "d9aa8ee2-a428-4cfb-824a-790c34aaab48" -> null
        id              = "Z05990652HOQ0SGHD81ZC_forms-staging.cdssandbox.xyz_A_form_viewer_forms-staging.cdssandbox.xyz_primary"
        name            = "forms-staging.cdssandbox.xyz"
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.form_viewer_maintenance_mode_certificate_validation["forms-staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz"
      + records         = [
          + "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

  # aws_s3_bucket_acl.maintenance_mode will be updated in-place
  ~ resource "aws_s3_bucket_acl" "maintenance_mode" {
      ~ acl    = "public-read" -> "private"
        id     = "gc-forms-application-maintenance-page,public-read"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.maintenance_mode will be destroyed
  # (because aws_s3_bucket_ownership_controls.maintenance_mode is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "maintenance_mode" {
      - bucket = "gc-forms-application-maintenance-page" -> null
      - id     = "gc-forms-application-maintenance-page" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
        id     = "gc-forms-application-maintenance-page"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource  = [
                          - "arn:aws:s3:::gc-forms-application-maintenance-page/*",
                          - "arn:aws:s3:::gc-forms-application-maintenance-page",
                        ] -> "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_public_access_block.maintenance_mode will be updated in-place
  ~ resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      ~ block_public_acls       = false -> true
      ~ block_public_policy     = false -> true
        id                      = "gc-forms-application-maintenance-page"
      ~ ignore_public_acls      = false -> true
      ~ restrict_public_buckets = false -> true
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = "gc-forms-application-maintenance-page"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 3 to add, 4 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.maintenance_static_page"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
